mmhmmh/PIC24/main.c
/****************************************************************************
* XLP 16-bit Development Board Demo
*
*   Demo has 3 low power modes and 4 sensor modes.
*   Low power modes:    Sleep (default), Deep Sleep, and Idle
*   Sensor modes:       Temprature, Voltage, Capacitance, and All Sensors
*    
*   In Temprature and Voltage modes the MCU wakes up on RTCC interrupt or
*   S2 button press to take a sample and store to external EEPROM.
*
*   In Capacitance and All sensor modes MCU wakes up on T1 interrupt to
*   sample Cap sense buttons.  Sample & storage occur on Cap sense button
*   press only.
*   
*   Switch Low power and sensor modes by holding S2 or S3.
*
*   Toggle UART transmission of data with S3 press.  EEPROM datalog can be
*   transmitted out on UART by resetting while holding S3.  
*****************************************************************************
* FileName:     main.c
* Dependencies: system.h
* Processor:    PIC24F16KA102
* Hardware:     XLP 16-bit Development Board
* Complier:     Microchip C30 v3.10 or higher
* Company:      Microchip Technology, Inc.
*
* Copyright and Disclaimer Notice
*
* Copyright ?007-2008 Microchip Technology Inc.  All rights reserved.
*
* Microchip licenses to you the right to use, modify, copy and distribute
* Software only when embedded on a Microchip microcontroller or digital
* signal controller and used with a Microchip radio frequency transceiver,
* which are integrated into your product or third party product (pursuant
* to the terms in the accompanying license agreement).
*
* You should refer to the license agreement accompanying this Software for
* additional information regarding your rights and obligations.
*
* SOFTWARE AND DOCUMENTATION ARE PROVIDED “AS IS?WITHOUT WARRANTY OF ANY
* KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY
* WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A
* PARTICULAR PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE
* LIABLE OR OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY,
* CONTRIBUTION, BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY
* DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO
* ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES,
* LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS,
* TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES (INCLUDING BUT
* NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*
* Author           Date         Comment
*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* Brant Ivey &     9/18/09      Initial Release
* Eric Yang
* Brant Ivey        4/1/10      Modified to add Harvester support.
*                               General bug fixes.
*****************************************************************************/

/****************************************************************************
  Section: Includes and Config bits
  ***************************************************************************/
#include "system.h"
#ifdef __PIC24F16KA301__
    // Setup configuration bits
    _FBS(BSS_OFF & BWRP_OFF)
    _FGS(GSS0_OFF & GWRP_OFF)
    _FOSCSEL(FNOSC_FRCDIV & IESO_OFF)
    _FOSC(FCKSM_CSECMD & POSCFREQ_MS & OSCIOFNC_ON & POSCMOD_NONE & SOSCSEL_SOSCLP)
    _FWDT(FWDTEN_OFF & WINDIS_OFF & FWPSA_PR128 & WDTPS_PS32768)
    _FPOR(MCLRE_ON & BORV_LPBOR & BOREN_BOR3 & I2C1SEL_PRI & PWRTEN_OFF)
    _FICD(ICS_PGx2)
    _FDS(DSWDTEN_OFF & DSBOREN_ON & DSWDTOSC_SOSC & DSWDTPS_DSWDTPSF) //DSWDT SOSC = LPRC
#elif defined __PIC24F16KA102__
    // Setup configuration bits
    _FBS(BSS_OFF & BWRP_OFF)
    _FGS(GCP_OFF & GWRP_OFF)
    _FOSCSEL(FNOSC_FRCDIV & IESO_OFF)
    _FOSC(FCKSM_CSECMD & POSCFREQ_MS & OSCIOFNC_ON & POSCMOD_NONE & SOSCSEL_SOSCLP)
    _FWDT(FWDTEN_OFF & WINDIS_OFF & FWPSA_PR128 & WDTPS_PS32768)
    _FPOR(MCLRE_ON & BORV_LPBOR & BOREN_BOR3 & I2C1SEL_PRI & PWRTEN_OFF)
    _FICD(BKBUG_OFF & ICS_PGx3)
    _FDS(DSWDTEN_OFF & DSBOREN_ON & RTCOSC_SOSC & DSWDTOSC_SOSC & DSWDTPS_DSWDTPSF) //DSWDT SOSC = LPRC
#elif defined(__PIC24FJ64GA102__)  
    // Setup configuration bits
    _CONFIG1(JTAGEN_OFF & GCP_OFF & GWRP_OFF & ICS_PGx3 & FWDTEN_OFF & WINDIS_OFF)
    _CONFIG2(IESO_ON & FCKSM_CSECMD & OSCIOFNC_ON & POSCMOD_NONE & FNOSC_FRC)
    _CONFIG3(SOSCSEL_LPSOSC & WUTSEL_FST & WPDIS_WPDIS & WPCFG_WPCFGDIS)
    _CONFIG4(DSWDTEN_OFF & RTCOSC_SOSC & DSWDTPS_DSWDTPS6 & DSWDTOSC_LPRC & DSBOREN_OFF)
#endif
   
#define MAG_ADDRESS      0x3C
#define GYRO_ADDRESS      0xD0
#define ACC_ADDRESS      0x38

#define I2C_WRITE           0x00
#define I2C_READ            0x01

#define HMC5883_ModeRegisterAddress 0x02
#define HMC5883_ContinuousModeCommand 0x00

#define HMC5883_ConfARegisterAddress 0x00
#define HMC5883_ConfBRegisterAddress 0x01
#define HMC5883_75HzCommand 0x18

#define L3G4200_CTRL_REG1 0x20
#define L3G4200_CTRL_REG1_SET 0x7F

#define L3G4200_CTRL_REG2 0x21
#define L3G4200_CTRL_REG2_SET 0x20

#define L3G4200_CTRL_REG3 0x22
#define L3G4200_CTRL_REG3_SET 0x00

#define L3G4200_CTRL_REG4 0x23
#define L3G4200_CTRL_REG4_SET 0x10

#define L3G4200_CTRL_REG5 0x24
#define L3G4200_CTRL_REG5_SET 0x00

#define L3G4200_OUT_TEMP 0x26
#define L3G4200_CONTINUOUS_READ 0x80
#define L3G4200_X_L 0x28

#define L3G4200_FIFO_CTRL_REG 0x2E
#define L3G4200_FIFO_CTRL_REG_SET 0x00


#define MMA8451Q_F_SETUP 0x09
#define MMA8451Q_F_SETUP_SET 0x00

#define MMA8451Q_TRIG_CFG 0x0A
#define MMA8451Q_TRIG_CFG_SET 0x00

#define MMA8451Q_XYZ_DATA_CFG 0x0E
#define MMA8451Q_XYZ_DATA_CFG_SET 0x02

#define MMA8451Q_FF_MT_CFG 0x15
#define MMA8451Q_FF_MT_CFG_SET 0x78

#define MMA8451Q_FF_MT_THS 0x17
#define MMA8451Q_FF_MT_THS_SET 0x00

#define MMA8451Q_CTRL_REG1 0x2A
#define MMA8451Q_CTRL_REG1_SET 0x01

#define MMA8451Q_CTRL_REG2 0x2B
#define MMA8451Q_CTRL_REG2_SET 0x02

#define MMA8451Q_CTRL_REG3 0x2C
#define MMA8451Q_CTRL_REG3_SET 0x00

#define MMA8451Q_CTRL_REG4 0x2D
#define MMA8451Q_CTRL_REG4_SET 0x00

#define MMA8451Q_CTRL_REG5 0x2E
#define MMA8451Q_CTRL_REG5_SET 0x00

#define GYRO_OUT_EN
#define MAG_OUT_EN
#define ACC_OUT_EN

/****************************************************************************
  Section: Global Variables
  ***************************************************************************/
RTCCFORM rtcc;          //RTCC read/write structure

WORD eeAddress = 0;     //EEPROM address pointer
WORD potVal;            //POT reading in mV
WORD tempVal;           //Temperature in 0.1*C
WORD vddVal;            //Board VDD level

WORD pressedCT1 = 0;    //Cap touch button 1 pressed flag
WORD pressedCT2 = 0;    //Cap touch button 2 pressed flag
WORD pressedCT3 = 0;    //Cap touch button 3 pressed flag

