mmhmmh/PIC24/main.c
LP_MODES lpMode;        //Current low power operating mode
DEMO_TASKS tasks;       //Tasks to execute flags




/****************************************************************************
  Section: Main Function
  ***************************************************************************/

/****************************************************************************
  Function:
    int main(void)

  Summary:
    Main function.

  Description:
    Main function.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
int main(void)
{

    //WORD_VAL modes;

    InitIO();      //configure I/O
    InitSystem();  //Initial system Setup
    //HandleReset(); //Process reset events (POR/DPSLP)

    IdleMs(500);

    //InitI2C();
	InitSPI();
	IdleMs(500);

	//nrf24l01_initialize_debug(false, 1, false);

	IdleMs(500);


	//SetupGyro();
	//SetupMag();
    //SetupAcc();

	BYTE dataVal[6];
    BYTE *pData;
    pData = dataVal;

	BYTE gyroDataVal[6];
   	BYTE *pGyroData;
   	pGyroData = gyroDataVal;
   	
   	BYTE accDataVal[6];
   	BYTE *pAccData;
   	pAccData = accDataVal;

   	_UxMD = 0;      //Enable UART
   	UARTInit();
   	BYTE dataIn = 0x00;

   	while(0) {
   		BYTE dataOut = 0x00;
   		dataIn = 0xFF;
   		//CSN1_LAT = 0;
   		//CSN1_LAT = 1;
   		dataOut = spi1_send_read_byte(dataIn);
   		UARTPutHex(dataOut);
   		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
   	}

   	while(0) {
   		dataIn += 1;
   		BYTE dataOut = 0x00;
   		//CSN1_LAT = 0;
   		dataOut = spi1_send_read_byte(dataIn);
   		//CSN1_LAT = 1;

   		UARTPrintString("Input:");
   		UARTPutHex(dataIn);
   		UARTPrintString("Output:");
   		UARTPutHex(dataOut);
   		UARTPrintString("\r\n");

   		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
   	}

   	//nrf24l01_power_down();

   	while(0) {
   		BYTE data;

   		CSN1_LAT = 0;
		data = spi1_send_read_byte(0xff);
		UARTPutHex(data);
		CSN1_LAT = 1;

   		CSN1_LAT = 0;
		data = spi1_send_read_byte(0x07);
		UARTPutHex(data);
		data = spi1_send_read_byte(0x00);
		UARTPutHex(data);
		CSN1_LAT = 1;

//   	   	nrf24l01_write_register(nrf24l01_EN_AA, data, 1);
//   	   	nrf24l01_read_register(nrf24l01_EN_AA, data, 1);
   	   	IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
		IdleMs(1000);
   	}

   	while(1) {
   		BYTE registerData[40];
   		BYTE *pRegisterData = registerData;
   		nrf24l01_get_all_registers(pRegisterData);
   		registerData[39] = '\0';
   		int i;
   		for (i=0; i<35;i++) {
   			UARTPrintString("Register");
   			UARTPutHex(i);
   			UARTPrintString(": ");
   			UARTPutHex(registerData[i]);
   			UARTPrintString("\r\n");
   		}
   		IdleMs(1000);
   		IdleMs(1000);
   		IdleMs(1000);
   		IdleMs(1000);
   	    IdleMs(1000);
   	    IdleMs(1000);
   	    IdleMs(1000);
   	    IdleMs(1000);
   	    IdleMs(1000);
   	}

	while(0)
    {	
		ReadMag(pData);
		//********************************************************************************************
		//Gyroscope code
		ReadGyro(pGyroData);

		//*****************************************************
		//Acc Code
		ReadAcc(pAccData);
		
		//***************************************************
		//UART Code
		_UxMD = 0;      //Enable UART
	    UARTInit();
	    
	    #ifdef ACC_OUT_EN
			//UARTPrintString("AccX: ");
			UARTPutHex(pAccData[0]);
			UARTPutHex(pAccData[1]);
			UARTPrintString(",");
			
			//UARTPrintString("AccY: ");
			UARTPutHex(pAccData[2]);
			UARTPutHex(pAccData[3]);
			UARTPrintString(",");
	
			//UARTPrintString("AccZ: ");
			UARTPutHex(pAccData[4]);
			UARTPutHex(pAccData[5]);
			UARTPrintString(",");
			//UARTPrintString("\r\n");
		#endif
		
		#ifdef MAG_OUT_EN
			//UARTPrintString("MagX: ");
			UARTPutHex(pData[0]);
			UARTPutHex(pData[1]);
			UARTPrintString(",");
			
			//UARTPrintString("MagY: ");
			UARTPutHex(pData[2]);
			UARTPutHex(pData[3]);
			UARTPrintString(",");
	
			//UARTPrintString("MagZ: ");
			UARTPutHex(pData[4]);
			UARTPutHex(pData[5]);
			UARTPrintString(",");
			//UARTPrintString("\r\n");
		#endif
		
		#ifdef GYRO_OUT_EN
			//UARTPrintString("GyroX: ");
			UARTPutHex(pGyroData[1]);
			UARTPutHex(pGyroData[0]);
			UARTPrintString(",");
			
			//UARTPrintString("GyroY: ");
			UARTPutHex(pGyroData[3]);
			UARTPutHex(pGyroData[2]);
			UARTPrintString(",");
	
			//UARTPrintString("GyroZ: ");
			UARTPutHex(pGyroData[5]);
			UARTPutHex(pGyroData[4]);
			UARTPrintString("\r\n");

		#endif
		
	    _UxMD = 1;

		IdleMs(100);
		
        
    }//end while(1)
	return 0;
}//end main

void ReadMag(BYTE *pData) {
	int i;
	//Send a start bit
	I2C1CONbits.SEN = 1;
	I2CWait();     //wait for interrupt

	for(i = 0; i<6;i++)
	{
		//Transmit the I2C address byte
		I2C1TRN = MAG_ADDRESS | I2C_WRITE;
		I2CWait();     //wait for interrupt
		I2C1TRN = i+3;
		I2CWait();     //wait for interrupt

		//Send a restart bit
		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt

		I2C1TRN = MAG_ADDRESS | I2C_READ;
		I2CWait();     //wait for interrupt

		//Receive a data byte
		I2C1CONbits.RCEN = 1;
		I2CWait();     //wait for interrupt
		//Read data
		pData[i] = I2C1RCV;

		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt
	}

	//Send the stop bit, ending this session
	I2C1CONbits.PEN = 1;
	I2CWait();     //wait for interrupt

}

void ReadAcc(BYTE *pAccData) {
	int i;
	//Send a start bit
	I2C1CONbits.SEN = 1;
	I2CWait();     //wait for interrupt

	for(i = 0; i<6;i++)
	{
		//Transmit the I2C address byte
		I2C1TRN = ACC_ADDRESS | I2C_WRITE;
		I2CWait();     //wait for interrupt
		I2C1TRN = i+1;
		I2CWait();     //wait for interrupt

		//Send a restart bit
		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt

		I2C1TRN = ACC_ADDRESS | I2C_READ;
		I2CWait();     //wait for interrupt

		//Receive a data byte
		I2C1CONbits.RCEN = 1;
		I2CWait();     //wait for interrupt
		//Read data
		pAccData[i] = I2C1RCV;

		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt
	}

