mmhmmh/PIC24/main.c
	//Send the stop bit, ending this session
	I2C1CONbits.PEN = 1;
	I2CWait();     //wait for interrupt
}

void ReadGyro(BYTE *pGyroData) {
	int i;
	//Send a start bit
	I2C1CONbits.SEN = 1;
	I2CWait();     //wait for interrupt

	//Read data packet
	for(i = 0; i<6;i++)
	{
		//Transmit the I2C address byte
		I2C1TRN = GYRO_ADDRESS | I2C_WRITE;
		I2CWait();     //wait for interrupt
		I2C1TRN = i+L3G4200_X_L;
		I2CWait();     //wait for interrupt

		//Send a restart bit
		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt
		
		I2C1TRN = GYRO_ADDRESS | I2C_READ;
		I2CWait();     //wait for interrupt

		//Receive a data byte
		I2C1CONbits.RCEN = 1;
		I2CWait();     //wait for interrupt
		//Read data
		pGyroData[i] = I2C1RCV;

		I2C1CONbits.RSEN = 1;
		I2CWait();     //wait for interrupt


	}

	//Send the stop bit, ending this session
	I2C1CONbits.PEN = 1;
	I2CWait();     //wait for interrupt
}


void SetupGyro(void) {
	configGyro(L3G4200_CTRL_REG1, L3G4200_CTRL_REG1_SET);
	configGyro(L3G4200_CTRL_REG2, L3G4200_CTRL_REG2_SET);
	configGyro(L3G4200_CTRL_REG3, L3G4200_CTRL_REG3_SET);
	configGyro(L3G4200_CTRL_REG4, L3G4200_CTRL_REG4_SET);
	configGyro(L3G4200_CTRL_REG5, L3G4200_CTRL_REG5_SET);
	configGyro(L3G4200_FIFO_CTRL_REG, L3G4200_FIFO_CTRL_REG_SET);
}

void SetupAcc(void) {
	configAcc(MMA8451Q_F_SETUP, MMA8451Q_F_SETUP_SET);
	configAcc(MMA8451Q_TRIG_CFG, MMA8451Q_TRIG_CFG_SET);
	configAcc(MMA8451Q_XYZ_DATA_CFG, MMA8451Q_XYZ_DATA_CFG_SET);
	configAcc(MMA8451Q_FF_MT_CFG, MMA8451Q_FF_MT_CFG_SET);
	configAcc(MMA8451Q_FF_MT_THS, MMA8451Q_FF_MT_THS_SET);
	
	configAcc(MMA8451Q_CTRL_REG1, MMA8451Q_CTRL_REG1_SET);
    configAcc(MMA8451Q_CTRL_REG2, MMA8451Q_CTRL_REG2_SET);	
    configAcc(MMA8451Q_CTRL_REG3, MMA8451Q_CTRL_REG3_SET);
    configAcc(MMA8451Q_CTRL_REG4, MMA8451Q_CTRL_REG4_SET);
    configAcc(MMA8451Q_CTRL_REG5, MMA8451Q_CTRL_REG5_SET);

}
	
void SetupMag(void) {
	//Send a start bit
    I2C1CONbits.SEN = 1;
    I2CWait();     //wait for interrupt

	//Transmit the I2C address byte
    I2C1TRN = MAG_ADDRESS | I2C_WRITE;
    I2CWait();     //wait for interrupt

    //Transmit data address
    I2C1TRN = HMC5883_ConfARegisterAddress;
    I2CWait();     //wait for interrupt
    I2C1TRN = HMC5883_75HzCommand;
    I2CWait();     //wait for interrupt

    //Send a restart bit
    I2C1CONbits.RSEN = 1;
    I2CWait();     //wait for interrupt

    //Transmit the I2C address byte
    I2C1TRN = MAG_ADDRESS | I2C_WRITE;
    I2CWait();     //wait for interrupt

    //Transmit data address
    I2C1TRN = HMC5883_ModeRegisterAddress;
    I2CWait();     //wait for interrupt
    I2C1TRN = HMC5883_ContinuousModeCommand;
    I2CWait();     //wait for interrupt

	//Send the stop bit, ending this session
    I2C1CONbits.PEN = 1;
    I2CWait();     //wait for interrupt
}

void configAcc(BYTE subaddr, BYTE value) {
    //Send a start bit
    I2C1CONbits.SEN = 1;
    I2CWait();     //wait for interrupt

    //Transmit the I2C address byte
    I2C1TRN = ACC_ADDRESS | I2C_WRITE;
    I2CWait();     //wait for interrupt

    //Transmit data address
    I2C1TRN = subaddr;
    I2CWait();     //wait for interrupt
    I2C1TRN = value;
    I2CWait();     //wait for interrupt

    //Send a stop bit
    I2C1CONbits.PEN = 1;
    I2CWait();     //wait for interrupt
}    

void configGyro(BYTE subaddr, BYTE value) {
	//Send a start bit
    I2C1CONbits.SEN = 1;
    I2CWait();     //wait for interrupt

    //Transmit the I2C address byte
    I2C1TRN = GYRO_ADDRESS | I2C_WRITE;
    I2CWait();     //wait for interrupt

    //Transmit data address
    I2C1TRN = subaddr;
    I2CWait();     //wait for interrupt
    I2C1TRN = value;
    I2CWait();     //wait for interrupt

    //Send a stop bit
    I2C1CONbits.PEN = 1;
    I2CWait();     //wait for interrupt

}


/****************************************************************************
  Section: MCU Intialization functions
  ***************************************************************************/


/****************************************************************************
  Function:
    void InitIO(void)

  Summary:
    Initializes I/O pins.

  Description:
    Initializes I/O pins.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void InitIO(void)
{
    LATA = 0;           //all io as output,o
    LATB = 0;
    TRISA = 0;
    TRISB = 0;

    ANSA = 0; //All digital
    ANSB = 0; //All digital

    // 1 is input - 0 is output

    //I2C Port Configuration
    SCL_TRIS = 1;       //SCL IH
    SDA_TRIS = 1;       //SDA IH

    //UART port configuration
    UTX_LAT = 0;
    UTX_TRIS = 0;       //U2TX OL
    URX_TRIS = 1;       //U2RX IH

	CSN1_LAT = 1;
	CSN1_TRIS = 0;

	CSN2_LAT = 1;
    CSN2_TRIS = 0;

	CE1_LAT = 0;
	CE1_TRIS = 0;

	CE2_LAT = 0;
    CE2_TRIS = 0;

    SCK_TRIS = 0;
    SCK_LAT = 0;
    SDI_TRIS = 1;
    SDO_TRIS = 0;
    SDO_LAT = 0;

}//end InitIO


/****************************************************************************
  Function:
    void InitSystem(void)

  Summary:
    Initializes system after a reset.

  Description:
    Initializes default system configuration.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void InitSystem (void)
{
    //Disable unused peripherals
    PMD1 = 0xFFFF;
    PMD2 = 0xFFFF;
    PMD3 = 0xFDFF;  //Enable RTCC
    PMD4 = 0xFFFF;

    AD1CON1 = 0;
    AD1CON2 = 0;
    AD1CON3 = 0;
    AD1CON5 = 0;

    HLVDCON = 0; // Disable HLV

    CLKDIVbits.RCDIV = 0;                   //Set FRCDIV to 8 MHz operation
    __builtin_write_OSCCONL(OSCCON | 0x02); //Enable 32kHz OSC
    SRbits.IPL = 2;                         //CPU > 1, no lvl 1 ISRs occur

    tasks.Val = 0;                          //intialize device mode
    tasks.bits.transmit = DEFAULT_TX;       //Set UART TX default state
	
}


/****************************************************************************
  Function:
    void HandleReset(void)

  Summary:
    Handles Initialization based on reset condition

  Description:
    Handles device reset and Initializes RTCC.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void HandleReset(void)
{
    WORD_VAL mode;

    #ifdef IPS_XLP_BOARD
    /*****************************************************
    * Delay for Regulator to settle
    * Note: This delay of 2ms is required befor any 
    *  peripheral devices using the same Supply line
    *  as the microcontroller can be activated to 
    *  ensure proper functionality.
    *****************************************************/
    IdleMs(2);
    #endif

    //Did wake up from Deep Sleep?
    if(RCONbits.DPSLP)
    {
        //wake up from Deep Sleep
        eeAddress = DSGPR0;
        mode.Val = DSGPR1;
        lpMode = mode.v[1];
        tasks.Val = mode.v[0];

        RCONbits.DPSLP = 0;
        DSCONbits.RELEASE = 0;      //release control and data bits for all I/Os

