mmhmmh/PIC24/main.c
        if(tasks.bits.transmit)
        {
            #ifdef USE_PWRCTL
            mPWR_ON();
            IdleMs(UART_WAIT);
            #endif
            _UxMD = 0;
            UARTInit();
            UARTPrintString("Wake from Deep Sleep...");
        }

        switch(ALARM_PERIOD)
        {
            case ONE_SECOND:
                SetRTCCAlarm(1);        //Alarm Every 1 second
                break;
            case TEN_SECOND:
                SetRTCCAlarm(2);        //Alarm Every 10 seconds
                break;
            default:
                break;
        }     

        if(DSWAKEbits.DSINT0 != 0)
        {
            if(tasks.bits.transmit)
            {
                UARTPrintString("  INT0\r\n");
            }

            tasks.bits.button = 1;
        }

        if(DSWAKEbits.DSFLT != 0)
        {
            if(tasks.bits.transmit)
            {
                UARTPrintString("  DSFLT\r\n");
            }
        }

        if(DSWAKEbits.DSWDT != 0)
        {
            if(tasks.bits.transmit)
            {
                UARTPrintString("  DSWDTT\r\n");
            }
        }

        if(DSWAKEbits.DSRTC != 0)
        {
            if(tasks.bits.transmit)
            {
                 UARTPrintString("  RTCC\r\n");
            }

            tasks.bits.sample = 1;
        }

        if(DSWAKEbits.DSMCLR != 0)
        {
            if(tasks.bits.transmit)
            {
                UARTPrintString("  MCLR\r\n");
            }
        }

        if(DSWAKEbits.DSPOR != 0)  //POR
        {
            if(tasks.bits.transmit)
            {
                UARTPrintString("  POR\r\n");
            }
        }
    }
    else     //Or is this Initial power on or sleep wakeup
    {

        #ifdef USE_PWRCTL
        mPWR_ON();
        IdleMs(UART_WAIT);
        #endif

        if(RCONbits.POR)
        {
            InitRTCC();                 //Initialize RTCC
			
			#ifdef USE_HARVESTER
            InitHarvester();            //Initialize harvester battery level detection
			#endif

            if(tasks.bits.transmit)     //Transmit to PC if TX en
            {
                _UxMD = 0;
                UARTInit();
                UARTPrintString("Microchip Technology Inc......nanoWatt XLP board \r\n");
                UARTPrintString("Click S2: Forces a Sample to be taken based on the currently sensor \r\n");
                UARTPrintString("Click S3: Toggles UART on/off. Output of data and the current device state \r\n");
				
				#ifndef USE_HARVESTER
                UARTPrintString("Hold S2 over 2 sec: switches sensor type\r\n");
                UARTPrintString("Hold S3 over 2 sec: switches low power mode \r\n");
				#endif
				
				UARTPrintString("Hold S2 on reset to clear RTCC and EEPROM data \r\n");
                UARTPrintString("Hold S3 on reset to transmit logged data to PC \r\n");

            }
        }

        if(RCONbits.EXTR)               //MCLR Reset
        {
		
			#ifdef USE_HARVESTER
            InitI2C();
            RestoreHarvesterState();    //Read harvester state from EEPROM after reset
			#endif

            if(tasks.bits.transmit)     //Transmit to PC if TX en
            {
                _UxMD = 0;
                UARTInit();
                IdleMs(UART_WAIT);
                UARTPrintString("MCLR reset occurred.\r\n\r\n");
            }
        }
        switch(ALARM_PERIOD)
        {
            case ONE_SECOND:
                SetRTCCAlarm(1);        //Alarm Every 1 second
                break;
            case TEN_SECOND:
                SetRTCCAlarm(2);        //Alarm Every 10 seconds
                break;
            default:
                break;
        }        
		
        RCON=0;                         //Clear reset flags

    }//end if(RCONbits.DPSLP)
    _UxMD = 1;
}//end HandleReset



/****************************************************************************
  Section: Time delay functions
  ***************************************************************************/

/****************************************************************************
  Function:
    void IdleUs(int timeUs)

  Summary:
    Waits in Idle mode for specified time in uS.

  Description:
    Waits in Idle mode using Timer2 for specified time in uS.
    Maximum time of 32 mS.

  Precondition:
    None.

  Parameters:
    int timeUs - time to wait in microseconds (uS)

  Returns:
    None.
  ***************************************************************************/
void IdleUs(int timeUs)
{
    _T2MD = 0;

    //Set T2 to timeout in indicated # mS
    TMR2 = 0;
    PR2 = (GetInstructionClock()/1000000)*timeUs;       //1 uS = 2 * 500 nS period (4 MHz)

    //Enable interrupt for wakeup
    _T2IE = 1;
    _T2IF = 0;
    _T2IP = 1;
    SRbits.IPL = 2; //CPU > T2, no ISR occurs
    T2CON = 0x8000;  //T2 w/ 4 mHz clock

    //Idle until T2 interrupt occurs
    while(!_T2IF)
    {
        Idle();                 //Idle Demo 2
    }

    //Disable interrupt and timer2
    _T2IF = 0;
    _T2IE = 0;
    T2CON = 0;
    _T2MD = 1;
}//end IdleUs


/****************************************************************************
  Function:
    void IdleMs(int timeMs)

  Summary:
    Waits in Idle mode for specified time in mS.

  Description:
    Waits in Idle mode using Timer2 for specified time in mS.
    Maximum time of 2 S.

  Precondition:
    None.

  Parameters:
    int timeMs - time to wait in milliseconds (mS)

  Returns:
    None.
  ***************************************************************************/
void IdleMs(int timeMs)
{
    _T2MD = 0;
    T2CON = 0x0000;

    //Set T2 to timeout in indicated # mS
    TMR2 = 0;
    PR2 = (GetInstructionClock()/64000)*timeMs; //1 mS

    //Enable interrupt for wakeup
    _T2IF = 0;
    _T2IP = 1;
    _T2IE = 1;
    T2CON = 0x8020;  //T2 1:64 mode; 62500 period

    //Idle until T2 interrupt occurs
    while(!_T2IF)
    {
        Idle();
    }

    //Disable interrupt and timer2
    _T2IF = 0;
    _T2IE = 0;
    T2CON = 0;
    _T2MD = 1;

