mmhmmh/PIC24/main.c
}//end IdleMs


/****************************************************************************
  Section: Interrupt Service Routines
  ***************************************************************************/

/****************************************************************************
  Function:
    void __attribute__ ((interrupt, shadow,auto_psv)) _RTCCInterrupt(void)

  Summary:
    RTCC interrupt handling routine.

  Description:
    Interrupt on RTCC alarm, indicate RTCC wakeup and Initiate new Sample.

  Precondition:
    InitRTCC();
    InitCalendar();

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void __attribute__ ((interrupt, shadow,auto_psv)) _RTCCInterrupt(void)
{
    IFS3bits.RTCIF = 0;     //Clear RTCC Alarm interrupt flag
    _RTCIE = 0;             //Disable RTCC interrupt until sleep

    if(tasks.bits.transmit) //Send wakeup source information
    {
        _UxMD = 0;
        UARTInit();
        IdleUs(5);  //Allow UART to stabilize to prevent glitch on first byte
        UARTPrintString("Wake from RTCC\r\n");
        _UxMD = 1;
    }

    tasks.bits.alarm = 1;
    tasks.bits.sample = 1;
}


/****************************************************************************
  Function:
    void __attribute__ ((interrupt, shadow,auto_psv)) _T2Interrupt(void)

  Summary:


  Description:


  Precondition:


  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void __attribute__ ((interrupt,auto_psv)) _T2Interrupt()
{
    _T2IF = 0;  //Clear T2 interrupt flag
}


/****************************************************************************
  Function:
    void __attribute__ ((interrupt, shadow,auto_psv)) _INT0Interrupt(void)

  Summary:
    ISR for Pushbutton S2

  Description:
    ISR for S2 button press, Initiates button Processing and sensor Samples.

  Precondition:
    EnableS2()

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void __attribute__ ((interrupt, shadow,auto_psv)) _INT0Interrupt(void)
{
    _INT0IF = 0;    //Clear INT0 interrupt flag
    _RTCIE = 0;     //disable RTCC interrupt until sleep

    tasks.bits.button = 1;
}


/****************************************************************************
  Function:
    void __attribute__ ((interrupt, shadow,auto_psv)) _CNInterrupt(void)

  Summary:
    ISR for Pushbutton S3

  Description:
    ISR for S3 button press, Initiates button Processing.

  Precondition:
    EnableS3()

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void __attribute__ ((interrupt, shadow,auto_psv)) _CNInterrupt(void)
{
    _CNIF = 0;      //Clear CN interrupt flag
    _RTCIE = 0;     //disable RTCC interrupt until sleep

    tasks.bits.button = 1;

}


/****************************************************************************
  Function:
    void __attribute__ ((interrupt, shadow,auto_psv)) _T1Interrupt(void)

  Summary:
    ISR for CTMU tick timer

  Description:
    ISR for CTMU tick timer, Initiates cap touch Processing.

  Precondition:
    InitCap()
    TickInit()

  Parameters:
    None.

  Returns:
    None.
  ***************************************************************************/
void  __attribute__((interrupt, shadow, auto_psv)) _T1Interrupt(void)
{
    //Clear flag
    IFS0bits.T1IF = 0;
    _RTCIE = 0;     //disable RTCC interrupt until sleep

    tasks.bits.cap = 1;
}


